const suffixList = ['ኦችኣችኧውንንኣ', 'ኦችኣችኧውን', 'ኣችኧውንንኣ', 'ኦችኣችህኡ', 'ኦችኣችኧው', 'ኢዕኧልኧሽ', 'ኣችኧውኣል', 'ኣልኣልኧች', 'ብኣችኧውስ', 'ኣልኣችህኡ', 'ውኦችንንኣ', 'ኝኣንኧትም', 'ኦችኣችን', 'ችኣችህኡ', 'ችኣችኧው', 'ኣልኧህኡ', 'ኣልችህኡ', 'ብኣችኧው', 'ኣችኧውን', 'ኣችህኡን', 'ኣችህኡት', 'ውኦችኡን', 'ኝኣንኧት', 'ኣችህኡም', 'ኦችንንኣ', 'ኣውኢው', 'ኣውኦች', 'ኣልኧህ', 'ኣልኧሽ', 'ኣልኧች', 'ኣልኧን', 'ኣችህኡ', 'ውኦችን', 'ኣችኧው', 'ውኦችኡ', 'ኦችኡን', 'ኝኣንኣ', 'ኝኣውም', 'ብኧትን', 'ችኣችን', 'ይኡሽን', 'ኝኣውን', 'ችኣት', 'ውንኣ', 'ውኦች', 'ኝኣን', 'ኝኣው', 'ኣውኣ', 'ኦችህ', 'ኦችሽ', 'ኦችኡ', 'ኦችኤ', 'ኦውኣ', 'ኤችኡ', 'ንኧው', 'ንኧት', 'ኣልኡ', 'ኣችን', 'ክኡም', 'ክኡት', 'ክኧው', 'ይኡሽ', 'ኣውኢ', 'ብኧት', 'ኦችኡ', 'ውኦን', 'ኝኣው', 'ኦችን', 'ኦቿ', 'ችው', 'ችኡ', 'ችን', 'ችም', 'ችህ', 'ችሽ', 'ችን', 'ችው', 'ውኢ', 'ኦች', 'ኝኣ', 'ኣል', 'ሽው', 'ክም', 'ኧው', 'ውኣ', 'ትም', 'ውኦ', 'ውም', 'ውን', 'ንም', 'ሽን', 'ኣች', 'ኡት', 'ኢት', 'ክኡ', 'ኡን', 'ንኣ', 'ም', 'ኢ', 'ኤ', 'ው', 'ህ', 'ሽ', 'ኡ', 'ሽ', 'ክ', 'ች', 'ን', 'ም', 'ኣ', 'ኧ', 'ኦ'];
const prefixList = ['ስልኧምኣይ', 'ይኧምኣት', 'ዕንድኧ', 'ይኧትኧ', 'ብኧምኣ', 'ብኧትኧ', 'ዕኧል', 'ስልኧ', 'ምኧስ', 'ዕይኧ', 'ይኣል', 'ስኣት', 'ስኣን', 'ስኣይ', 'ስኣል', 'ይኣስ', 'ይኧ', 'ልኧ', 'ብኧ', 'ክኧ', 'እን', 'አል', 'አስ', 'ትኧ', 'አት', 'አን', 'አይ', 'ይኧ', 'አ', 'እ'];

const amharicChar = {
    'ሀ': 'ህኧ',
    'ሁ': 'ህኡ',
    'ሂ': 'ህኢ',
    'ሃ': 'ህኣ',
    'ሄ': 'ህኤ',
    'ህ': 'ህ',
    'ሆ': 'ህኦ',
    'ለ': 'ልኧ',
    'ሉ': 'ልኡ',
    'ሊ': 'ልኢ',
    'ላ': 'ልኣ',
    'ሌ': 'ልኤ',
    'ል': 'ል',
    'ሎ': 'ልኦ',
    'መ': 'ምኧ',
    'ሙ': 'ምኡ',
    'ሚ': 'ምኢ',
    'ማ': 'ምኣ',
    'ሜ': 'ምኤ',
    'ም': 'ም',
    'ሞ': 'ምኦ',
    'ረ': 'ርኧ',
    'ሩ': 'ርኡ',
    'ሪ': 'ርኢ',
    'ራ': 'ርኣ',
    'ሬ': 'ርኤ',
    'ር': 'ር',
    'ሮ': 'ርኦ',
    'ሰ': 'ስኧ',
    'ሱ': 'ስኡ',
    'ሲ': 'ስኢ',
    'ሳ': 'ስኣ',
    'ሴ': 'ስኤ',
    'ስ': 'ስ',
    'ሶ': 'ስኦ',
    'ሸ': 'ሽኧ',
    'ሹ': 'ሽኡ',
    'ሺ': 'ሽኢ',
    'ሻ': 'ሽኣ',
    'ሼ': 'ሽኤ',
    'ሽ': 'ሽ',
    'ሾ': 'ሽኦ',
    'ቀ': 'ቅኧ',
    'ቁ': 'ቅኡ',
    'ቂ': 'ቅኢ',
    'ቃ': 'ቅኣ',
    'ቄ': 'ቅኤ',
    'ቅ': 'ቅ',
    'ቆ': 'ቅኦ',
    'በ': 'ብኧ',
    'ቡ': 'ብኡ',
    'ቢ': 'ብኢ',
    'ባ': 'ብኣ',
    'ቤ': 'ብኤ',
    'ብ': 'ብ',
    'ቦ': 'ብኦ',
    'ቨ': 'ቭኧ',
    'ቩ': 'ቭኡ',
    'ቪ': 'ቭኢ',
    'ቫ': 'ቭኣ',
    'ቬ': 'ቭኤ',
    'ቭ': 'ቭ',
    'ቮ': 'ቭኦ',
    'ተ': 'ትኧ',
    'ቱ': 'ትኡ',
    'ቲ': 'ትኢ',
    'ታ': 'ትኣ',
    'ቴ': 'ትኤ',
    'ት': 'ት',
    'ቶ': 'ትኦ',
    'ቸ': 'ችኧ',
    'ቹ': 'ችኡ',
    'ቺ': 'ችኢ',
    'ቻ': 'ችኣ',
    'ቼ': 'ችኤ',
    'ች': 'ች',
    'ቾ': 'ችኦ',
    'ነ': 'ንኧ',
    'ኑ': 'ንኡ',
    'ኒ': 'ንኢ',
    'ና': 'ንኣ',
    'ኔ': 'ንኤ',
    'ን': 'ን',
    'ኖ': 'ንኦ',
    'ኘ': 'ኝኧ',
    'ኙ': 'ኝኡ',
    'ኚ': 'ኝኢ',
    'ኛ': 'ኝኣ',
    'ኜ': 'ኝኤ',
    'ኝ': 'ኝ',
    'ኞ': 'ኝኦ',
    'አ': 'አ',
    'ኡ': 'ኡ',
    'ኢ': 'ኢ',
    'ኣ': 'ኣ',
    'ኤ': 'ኤ',
    'እ': 'እ',
    'ኦ': 'ኦ',
    'ከ': 'ክኧ',
    'ኩ': 'ክኡ',
    'ኪ': 'ክኢ',
    'ካ': 'ክኣ',
    'ኬ': 'ክኤ',
    'ክ': 'ክ',
    'ኮ': 'ክኦ',
    'ኸ': 'ኽኧ',
    'ኹ': 'ኽኡ',
    'ኺ': 'ኽኢ',
    'ኻ': 'ኽኣ',
    'ኼ': 'ኽኤ',
    'ኽ': 'ኽ',
    'ኾ': 'ኽኦ',
    'ወ': 'ውኧ',
    'ዉ': 'ውኡ',
    'ዊ': 'ውኢ',
    'ዋ': 'ውኣ',
    'ዌ': 'ውኤ',
    'ው': 'ው',
    'ዎ': 'ውኦ',
    'ዘ': 'ዝኧ',
    'ዙ': 'ዝኡ',
    'ዚ': 'ዝኢ',
    'ዛ': 'ዝኣ',
    'ዜ': 'ዝኤ',
    'ዝ': 'ዝ',
    'ዞ': 'ዝኦ',
    'ዠ': 'ዥኧ',
    'ዡ': 'ዥኡ',
    'ዢ': 'ዥኢ',
    'ዣ': 'ዥኣ',
    'ዤ': 'ዥኤ',
    'ዥ': 'ዥ',
    'ዦ': 'ዥኦ',
    'የ': 'ይኧ',
    'ዩ': 'ይኡ',
    'ዪ': 'ይኢ',
    'ያ': 'ይኣ',
    'ዬ': 'ይኤ',
    'ይ': 'ይ',
    'ዮ': 'ይኦ',
    'ደ': 'ድኧ',
    'ዱ': 'ድኡ',
    'ዲ': 'ድኢ',
    'ዳ': 'ድኣ',
    'ዴ': 'ድኤ',
    'ድ': 'ድ',
    'ዶ': 'ድኦ',
    'ጀ': 'ጅኧ',
    'ጁ': 'ጅኡ',
    'ጂ': 'ጅኢ',
    'ጃ': 'ጅኣ',
    'ጄ': 'ጅኤ',
    'ጅ': 'ጅ',
    'ጆ': 'ጅኦ',
    'ገ': 'ግኧ',
    'ጉ': 'ግኡ',
    'ጊ': 'ግኢ',
    'ጋ': 'ግኣ',
    'ጌ': 'ግኤ',
    'ግ': 'ግ',
    'ጎ': 'ግኦ',
    'ጠ': 'ጥኧ',
    'ጡ': 'ጥኡ',
    'ጢ': 'ጥኢ',
    'ጣ': 'ጥኣ',
    'ጤ': 'ጥኤ',
    'ጥ': 'ጥ',
    'ጦ': 'ጥኦ',
    'ጨ': 'ጭኧ',
    'ጩ': 'ጭኡ',
    'ጪ': 'ጭኢ',
    'ጫ': 'ጭኣ',
    'ጬ': 'ጭኤ',
    'ጭ': 'ጭ',
    'ጮ': 'ጭኦ',
    'ጰ': 'ጵኧ',
    'ጱ': 'ጵኡ',
    'ጲ': 'ጵኢ',
    'ጳ': 'ጵኣ',
    'ጴ': 'ጵኤ',
    'ጵ': 'ጵ',
    'ጶ': 'ጵኦ',
    'ፀ': 'ፅኧ',
    'ፁ': 'ፅኡ',
    'ፂ': 'ፅኢ',
    'ፃ': 'ፅኣ',
    'ፄ': 'ፅኤ',
    'ፅ': 'ፅ',
    'ፆ': 'ፅኦ',
    'ፈ': 'ፍኧ',
    'ፉ': 'ፍኡ',
    'ፊ': 'ፍኢ',
    'ፋ': 'ፍኣ',
    'ፌ': 'ፍኤ',
    'ፍ': 'ፍ',
    'ፎ': 'ፍኦ',
    'ፐ': 'ፕኧ',
    'ፑ': 'ፕኡ',
    'ፒ': 'ፕኢ',
    'ፓ': 'ፕኣ',
    'ፔ': 'ፕኤ',
    'ፕ': 'ፕ',
    'ፖ': 'ፕኦ',
};

function stem(termLoc) {
    Object.keys(termLoc).forEach((word) => {
        let finalWord = '';

        word.split('').forEach(char => {
            finalWord += amharicChar[char];
        });

        // if (finalWord.length >= 3) {
        //     prefixList.forEach(pre => {
        //         if (finalWord.startsWith(pre) && finalWord.length - pre.length >= 3) {
        //             finalWord = finalWord.substring(pre.length);
        //         }
        //     });
        //     suffixList.forEach(suffix => {
        //         if (finalWord.endsWith(suffix) && finalWord.length - suffix.length >= 3) {
        //             finalWord = finalWord.substring(0, finalWord.length - suffix.length);
        //         }
        //     });
        // }

        if (finalWord === 'ህኡል') {
            console.log('Hi');
        }
        if (finalWord === word) return;

        if (finalWord in termLoc) {
            for (const doc in termLoc[word]) {
                let f = termLoc[word][doc];

                if (doc in termLoc[finalWord])
                    f += termLoc[finalWord][doc];

                termLoc[finalWord][doc] = f;
            }
        } else {
            termLoc[finalWord] = termLoc[word];
        }

        delete termLoc[word];
    });
}

module.exports = {stem};